Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# AdvancedSetting.fileDropCoprocess
source: When files are dropped into a terminal window, execute a silent coprocess. This is an interpolated string. Use \(filenames) to reference the shell-quoted, space-delimited full paths to the dropped files. If this preference is empty, the filenames get pasted instead.
de: Wenn Dateien in ein Terminalfenster gezogen werden, einen stillen Koprozess ausführen. Dies ist eine interpolierte Zeichenfolge. Verwenden Sie \(filenames), um auf die shell-maskierten, durch Leerzeichen getrennten vollständigen Pfade der abgelegten Dateien zu verweisen. Wenn diese Einstellung leer ist, werden stattdessen die Dateinamen eingefügt.
ja: ファイルをターミナルウィンドウにドロップしたとき、サイレントなコプロセスを実行します。 これは補間文字列です。ドロップされたファイルのシェルクォートされた、スペース区切りのフルパスを参照するには \(filenames) を使用してください。この設定が空の場合、代わりにファイル名が貼り付けられます。
pt_br: Quando arquivos são soltos em uma janela do terminal, executar um coprocess silencioso. Esta é uma string interpolada. Use \(filenames) para referenciar os caminhos completos, separados por espaço e com escape de shell, dos arquivos soltos. Se esta preferência estiver vazia, os nomes de arquivo são colados em vez disso.
ru: При перетаскивании файлов в окно терминала выполнять тихий сопроцесс. Это интерполированная строка. Используйте \(filenames) для ссылки на экранированные для оболочки, разделённые пробелами полные пути к перетащенным файлам. Если эта настройка пуста, вместо этого имена файлов будут вставлены.
zh_hans: 当文件被拖入终端窗口时，运行一个静默的协处理程序。 这是一个插值字符串。可使用\(\filenames\)来引用以shell引号括起、用空格分隔的被拖入文件的完整路径。如果此选项为空，则文件名将被直接粘贴。

# AdvancedSetting.filenameCharacterSet
source: Non-alphanumeric characters considered part of a filename. Note that URL characters (a separate advanced setting) are also allowed. Letters and numbers are always considered part of the URL. These non-alphanumeric characters are used in addition for the purposes of figuring out where a file begins and ends. You must restart iTerm2 for changes to this setting to take effect.
de: Nicht alphanumerische Zeichen, die als Teil eines Dateinamens gelten. Beachten Sie, dass URL-Zeichen (eine separate erweiterte Einstellung) ebenfalls erlaubt sind. Buchstaben und Zahlen gelten immer als Teil der URL. Diese nicht alphanumerischen Zeichen werden zusätzlich verwendet, um festzustellen, wo eine Datei beginnt und endet. Sie müssen iTerm2 neu starten, damit Änderungen an dieser Einstellung wirksam werden.
ja: ファイル名の一部とみなされる英数字以外の文字。URL の文字 (別の詳細設定) も許可される点に注意してください。 英字と数字は常に URL の一部とみなされます。これらの英数字以外の文字は、ファイルの開始位置と終了位置を判断する目的で追加的に使用されます。この設定の変更を反映するには iTerm2 を再起動する必要があります。
pt_br: Caracteres não alfanuméricos considerados parte de um nome de arquivo. Observe que caracteres de URL (um ajuste avançado separado) também são permitidos. Letras e números são sempre considerados parte da URL. Esses caracteres não alfanuméricos são usados adicionalmente para determinar onde um arquivo começa e termina. Você deve reiniciar o iTerm2 para que as alterações neste ajuste tenham efeito.
ru: Символы не из букв и цифр, считающиеся частью имени файла. Обратите внимание, что символы URL (отдельная дополнительная настройка) также разрешены. Буквы и цифры всегда считаются частью URL. Эти не буквенно-цифровые символы используются дополнительно для определения начала и конца файла. Для вступления изменений этой настройки в силу нужно перезапустить iTerm2.
zh_hans: 视为文件名组成部分的非字母数字字符。请注意，URL字符（属于单独的高级设置）也是允许的。 字母和数字始终被视为URL的一部分。这些非字母数字字符则用于进一步确定文件的起始点和结束点。更改此设置后需重启iTerm2才能生效。

# AdvancedSetting.findDelaySeconds
source: Time to wait before performing Find action on 1- or 2- character queries.
de: Wartezeit, bevor bei 1- oder 2-Zeichen-Suchanfragen die Suche ausgeführt wird.
ja: 1 文字または 2 文字のクエリで検索アクションを実行するまでの待機時間。
pt_br: Tempo a aguardar antes de realizar a ação de Busca em consultas de 1 ou 2 caracteres.
ru: Время ожидания перед выполнением действия поиска для запросов из 1 или 2 символов.
zh_hans: 对长度为1位或2位的查询执行“查找”操作前的等待时间。

# AdvancedSetting.findUrlsRegex
source: Regular expression for “Find URLs” command.
de: Regulärer Ausdruck für den Befehl „URLs suchen“.
ja: 「URL を検索」コマンド用の正規表現。
pt_br: Expressão regular para o comando “Buscar URLs”.
ru: Регулярное выражение для команды «Найти URL».
zh_hans: “查找URL”命令所使用的正则表达式。

# AdvancedSetting.findURLsRespectsSoftBoundaries
source: When using “Find URLs”, extend results across soft boundaries like tmux pane dividers.
de: Bei Verwendung von „URLs suchen“ Ergebnisse über weiche Grenzen wie tmux-Bereichstrennlinien hinweg erweitern.
ja: 「URL を検索」を使用する際、tmux のペイン区切りなどのソフトな境界をまたいで結果を拡張します。
pt_br: Ao usar “Buscar URLs”, estender os resultados através de fronteiras suaves como divisores de painel do tmux.
ru: При использовании «Найти URL» расширять результаты через мягкие границы, такие как разделители панелей tmux.
zh_hans: 使用“查找URL”时，将搜索结果扩展到tmux窗格分隔线等软边界之外。

# AdvancedSetting.fixMouseWheel
source: Mouse wheel always scrolls when scroll bars are visible
de: Mausrad scrollt immer, wenn Bildlaufleisten sichtbar sind
ja: スクロールバーが表示されているとき、マウスホイールは常にスクロールします
pt_br: A roda do mouse sempre rola quando as barras de rolagem estão visíveis
ru: Колесо мыши всегда прокручивает, когда полосы прокрутки видны
zh_hans: 即使显示了滚动条，鼠标滚轮也始终会触发滚动

# AdvancedSetting.focusNewSplitPaneWithFocusFollowsMouse
source: When focus follows mouse is enabled, should new split panes automatically be focused?
de: Sollen neue geteilte Bereiche automatisch fokussiert werden, wenn „Fokus folgt der Maus“ aktiviert ist?
ja: フォーカスがマウスに追従する設定が有効な場合、新しい分割ペインに自動的にフォーカスしますか?
pt_br: Quando o foco segue o mouse está ativado, novos painéis divididos devem ser focados automaticamente?
ru: Когда включено «фокус следует за мышью», должны ли новые разделённые панели автоматически получать фокус?
zh_hans: 启用“焦点跟随鼠标”功能时，新创建的分屏窗格是否应自动获得焦点？

# AdvancedSetting.focusReportingEnabled
source: Apps may turn on Focus Reporting. Focus reporting causes iTerm2 to send an escape sequence when a session gains or loses focus. It can cause problems when an ssh session dies unexpectedly because it gets left on, so some users prefer to disable it.
de: Anwendungen dürfen die Fokus-Berichterstattung aktivieren. Die Fokus-Berichterstattung veranlasst iTerm2, eine Escape-Sequenz zu senden, wenn eine Sitzung den Fokus erhält oder verliert. Sie kann Probleme verursachen, wenn eine SSH-Sitzung unerwartet endet, da sie dann aktiviert bleibt. Manche Benutzer deaktivieren sie deshalb lieber.
ja: アプリがフォーカスレポートをオンにできるようにします。 フォーカスレポートが有効な場合、セッションがフォーカスを得たり失ったりしたときに iTerm2 はエスケープシーケンスを送信します。SSH セッションが予期せず切断された際にオンのままになってしまい問題を引き起こすことがあるため、これを無効にしたいユーザーもいます。
pt_br: Apps podem ativar o Relatório de foco. O relatório de foco faz o iTerm2 enviar uma sequência de escape quando uma sessão ganha ou perde o foco. Pode causar problemas quando uma sessão ssh morre inesperadamente porque fica ativado, então alguns usuários preferem desativá-lo.
ru: Приложения могут включать отчёт о фокусе. Отчёт о фокусе заставляет iTerm2 отправлять управляющую последовательность при получении или потере фокуса сессией. Это может вызывать проблемы, когда сессия ssh неожиданно завершается, а функция остаётся включённой, поэтому некоторые пользователи предпочитают отключать её.
zh_hans: 应用程序可能会开启焦点报告功能。 焦点报告功能会在会话获得或失去焦点时让iTerm2发送转义序列。当SSH会话意外终止而该功能仍处于开启状态时，可能会引发问题，因此有些用户更倾向于关闭它。

# AdvancedSetting.fontChangeAffectsBroadcastingSessions
source: Should growing or shrinking the font in a session that's broadcasting input affect all session that broadcast input? This only applies to changing the font size with Make Text Bigger, Make Text Normal Size, and Make Text Smaller
de: Soll das Vergrößern oder Verkleinern der Schrift in einer Sitzung, die Eingaben überträgt, alle Sitzungen betreffen, die Eingaben übertragen? Dies gilt nur für die Änderung der Schriftgröße mit „Text vergrößern“, „Normale Textgröße“ und „Text verkleinern“
ja: 入力をブロードキャスト中のセッションでフォントを拡大・縮小したとき、入力をブロードキャストしているすべてのセッションに影響させますか? これは、「テキストを大きくする」「テキストを標準サイズにする」「テキストを小さくする」でフォントサイズを変更する場合にのみ適用されます
pt_br: Aumentar ou diminuir a fonte em uma sessão que está transmitindo entrada deve afetar todas as sessões que transmitem entrada? Isto só se aplica a alterar o tamanho da fonte com Aumentar o texto, Tamanho normal do texto e Diminuir o texto
ru: Должно ли увеличение или уменьшение шрифта в сессии, транслирующей ввод, влиять на все сессии, транслирующие ввод? Это применяется только при изменении размера шрифта командами «Увеличить текст», «Обычный размер текста» и «Уменьшить текст»
zh_hans: 在正在传输输入的会话中调整字体大小，是否会影响所有也在传输输入的会话？ 此规则仅适用于通过“放大文本”、“恢复文本正常大小”和“缩小文本”来调整字体大小的情况。

# AdvancedSetting.fontsForGenerousRounding
source: List of fonts to use alternate rounding algorithm for line height calculation. This fixes consolas and emulates Terminal.app’s behavior on macOS 10.15. This is a comma-delimited list of font family substrings.
de: Liste von Schriftarten, für die ein alternativer Rundungsalgorithmus zur Berechnung der Zeilenhöhe verwendet wird. Dies behebt Probleme mit Consolas und ahmt das Verhalten von Terminal.app unter macOS 10.15 nach. Dies ist eine durch Kommas getrennte Liste von Teilzeichenfolgen für Schriftfamilien.
ja: 行の高さの計算に別の丸めアルゴリズムを使用するフォントのリスト。 これにより Consolas の問題が修正され、macOS 10.15 での Terminal.app の動作をエミュレートします。フォントファミリー名の部分文字列をカンマ区切りで指定するリストです。
pt_br: Lista de fontes para usar o algoritmo de arredondamento alternativo no cálculo da altura da linha. Isto corrige o consolas e emula o comportamento do Terminal.app no macOS 10.15. Esta é uma lista, separada por vírgulas, de substrings de família de fonte.
ru: Список шрифтов, для которых используется альтернативный алгоритм округления при расчёте высоты строки. Это исправляет Consolas и имитирует поведение Terminal.app в macOS 10.15. Список подстрок семейств шрифтов, разделённых запятыми.
zh_hans: 用于在线性高度计算中采用替代四舍五入算法的字体列表。 此设置可修复consolas的问题，并模拟macOS 10.15版本中Terminal.app的行为。该列表为以逗号分隔的字体系列子串。

# AdvancedSetting.forceAntialiasingOnRetina
source: Force text to be anti-aliased on Retina displays. Enable this to use non-AA text on non-retina displays, which sometimes looks better.
de: Text auf Retina-Displays erzwungen glätten (Anti-Aliasing). Aktivieren Sie dies, um auf Nicht-Retina-Displays nicht geglätteten Text zu verwenden, der manchmal besser aussieht.
ja: Retina ディスプレイでテキストを強制的にアンチエイリアス処理します。 これを有効にすると、非 Retina ディスプレイではアンチエイリアスなしのテキストを使用できます。こちらの方が見た目が良い場合があります。
pt_br: Forçar o texto a ter anti-aliasing em telas Retina. Ative isto para usar texto sem AA em telas não retina, o que às vezes fica melhor.
ru: Принудительно сглаживать текст на дисплеях Retina. Включите это, чтобы использовать текст без сглаживания на дисплеях, отличных от Retina, что иногда выглядит лучше.
zh_hans: 强制在视网膜显示屏上对文本进行抗锯齿处理。 启用此选项可在非视网膜显示屏上使用非抗锯齿文本，这类文本有时看起来效果更好。

# AdvancedSetting.fractionOfCharacterSelectingNextNeighbor
source: Fraction of character’s width on its right side that can be used to select the character to its right.
de: Anteil der Zeichenbreite auf der rechten Seite, der zur Auswahl des rechts benachbarten Zeichens verwendet werden kann.
ja: 文字の右側の幅のうち、右隣の文字を選択するために使用できる割合。
pt_br: Fração da largura do caractere no seu lado direito que pode ser usada para selecionar o caractere à sua direita.
ru: Доля ширины символа с правой стороны, которая может использоваться для выбора символа справа от него.
zh_hans: 可用于选取右侧字符的、位于该字符右侧的那部分宽度比例。

# AdvancedSetting.fullHeightCursor
source: Cursor occupies line spacing area. If lines have more than 100% vertical spacing and this setting is enabled the bottom of the cursor will be aligned to the bottom of the spacing area.
de: Cursor nimmt den Zeilenabstandsbereich ein. Wenn Zeilen einen vertikalen Abstand von mehr als 100 % haben und diese Einstellung aktiviert ist, wird die Unterkante des Cursors an der Unterkante des Abstandsbereichs ausgerichtet.
ja: カーソルが行間の領域を占めるようにします。 行の垂直方向の間隔が 100% を超えていて、この設定が有効な場合、カーソルの下端は間隔領域の下端に揃えられます。
pt_br: O cursor ocupa a área de espaçamento entre linhas. Se as linhas tiverem mais de 100% de espaçamento vertical e este ajuste estiver ativado, a parte inferior do cursor será alinhada à parte inferior da área de espaçamento.
ru: Курсор занимает область межстрочного интервала. Если строки имеют межстрочный интервал больше 100 % и эта настройка включена, нижняя часть курсора будет выровнена по нижнему краю области интервала.
zh_hans: 光标会占据行间距区域。 如果行的垂直间距超过100%，且启用了此设置，则光标的底部会与间距区域的底部对齐。

# AdvancedSetting.fullWidthFlags
source: Flag emoji render full-width
de: Flaggen-Emojis in voller Breite darstellen
ja: 国旗の絵文字を全角で表示する
pt_br: Emojis de bandeira renderizam em largura total
ru: Флаги-эмодзи отображаются на полную ширину
zh_hans: 标记表情符号为全宽显示

# AdvancedSetting.generativeAIAllowed
source: Allow the use of large language model APIs? The purpose of this setting is to make it easy for managed environments to disable the use of LLMs. The user defaults key is `GenerativeAIAllowed`.
de: Die Verwendung von APIs für große Sprachmodelle erlauben? Der Zweck dieser Einstellung besteht darin, verwalteten Umgebungen die Deaktivierung der Verwendung von LLMs zu erleichtern. Der User-Defaults-Schlüssel ist `GenerativeAIAllowed`.
ja: 大規模言語モデル (LLM) API の使用を許可しますか? この設定の目的は、管理環境で LLM の使用を簡単に無効化できるようにすることです。ユーザーデフォルトのキーは `GenerativeAIAllowed` です。
pt_br: Permitir o uso de APIs de grandes modelos de linguagem? O propósito deste ajuste é facilitar que ambientes gerenciados desativem o uso de LLMs. A chave de user defaults é `GenerativeAIAllowed`.
ru: Разрешить использование API больших языковых моделей? Цель этой настройки — упростить управляемым средам отключение использования LLM. Ключ пользовательских настроек — `GenerativeAIAllowed`.
zh_hans: 允许使用大型语言模型API？ 设置此选项的目的是便于受管理环境禁用LLM的使用。用户的默认值为`GenerativeAIAllowed`。

# AdvancedSetting.gitSearchPath
source: $PATH used when running git for the status bar component. Change this to use a custom install of git. You must restart iTerm2 for a change here to take effect.
de: $PATH, das beim Ausführen von git für die Statusleisten-Komponente verwendet wird. Ändern Sie dies, um eine benutzerdefinierte Installation von git zu verwenden. Sie müssen iTerm2 neu starten, damit eine Änderung hier wirksam wird.
ja: ステータスバーコンポーネント用に git を実行する際に使用する $PATH。 git のカスタムインストールを使用するにはこれを変更してください。ここでの変更を反映するには iTerm2 を再起動する必要があります。
pt_br: $PATH usado ao executar o git para o componente da barra de status. Altere isto para usar uma instalação personalizada do git. Você deve reiniciar o iTerm2 para que uma alteração aqui tenha efeito.
ru: $PATH, используемый при запуске git для компонента строки состояния. Измените это, чтобы использовать пользовательскую установку git. Для вступления изменения в силу нужно перезапустить iTerm2.
zh_hans: 用于状态栏组件的git运行时的$PATH路径。 可更改此值以使用自定义安装的git版本。此处所做的更改需重启iTerm2才能生效。

# AdvancedSetting.gitTimeout
source: Timeout in seconds when running git for the status bar component.
de: Timeout in Sekunden beim Ausführen von Git für die Statusleisten-Komponente.
ja: ステータスバーコンポーネント用に git を実行する際のタイムアウト (秒単位)。
pt_br: Tempo limite em segundos ao executar o git para o componente da barra de status.
ru: Тайм-аут в секундах при запуске git для компонента строки состояния.
zh_hans: 用于状态栏组件的git运行时的超时时间（以秒为单位）。

# AdvancedSetting.hdrCursor
source: HDR cursor Experimental. Half-baked. Probably don't use this.
de: HDR-Cursor Experimentell. Unausgereift. Sollte wahrscheinlich nicht verwendet werden.
ja: HDR カーソル 実験的機能です。未完成です。おそらく使用しない方がよいでしょう。
pt_br: Cursor HDR Experimental. Meio pronto. Provavelmente não use isto.
ru: HDR-курсор Экспериментально. Сделано наполовину. Вероятно, не стоит это использовать.
zh_hans: HDR光标 实验性功能，尚未完善。建议不要使用。

# AdvancedSetting.hideStuckTooltips
source: Hide stuck tooltips. When you hide iTerm2 using a hotkey while a tooltip is fading out it gets stuck because of an OS bug. Work around it with a nasty hack by enabling this feature.
de: Hängende Tooltips ausblenden. Wenn Sie iTerm2 mit einer Hotkey-Taste ausblenden, während ein Tooltip gerade ausgeblendet wird, bleibt er aufgrund eines Betriebssystemfehlers hängen. Umgehen Sie dies mit einem unschönen Hack, indem Sie diese Funktion aktivieren.
ja: 固まったツールチップを非表示にします。 ツールチップがフェードアウト中にホットキーで iTerm2 を非表示にすると、OS のバグによりツールチップが固まってしまいます。この機能を有効にすると、強引なハックでこれを回避します。
pt_br: Ocultar dicas travadas. Quando você oculta o iTerm2 usando uma hotkey enquanto uma dica está desaparecendo, ela fica travada por causa de um bug do sistema. Contorne isso com um hack desagradável ativando este recurso.
ru: Скрывать зависшие подсказки. Когда вы скрываете iTerm2 горячей клавишей во время затухания подсказки, она зависает из-за ошибки ОС. Обойдите это неприятным хаком, включив эту функцию.
zh_hans: 隐藏卡住的工具提示。 当工具提示正在消失时通过热键隐藏iTerm2，由于操作系统缺陷会导致工具提示卡住。可通过启用此功能来作为变通方案。

# AdvancedSetting.highVisibility
source: High Contrast modes maximize visibility. When enabled, the dark high-contrast theme emphasizes visibility over beauty.
de: High-Contrast-Modi maximieren die Sichtbarkeit. Wenn aktiviert, legt das dunkle High-Contrast-Design mehr Wert auf Sichtbarkeit als auf Optik.
ja: ハイコントラストモードで視認性を最大化します。 有効にすると、ダークハイコントラストテーマは美しさよりも視認性を重視します。
pt_br: Os modos de Alto Contraste maximizam a visibilidade. Quando ativado, o tema escuro de alto contraste enfatiza a visibilidade em vez da beleza.
ru: Режимы High Contrast максимизируют видимость. При включении тёмная тема высокой контрастности делает упор на видимость, а не на красоту.
zh_hans: 高对比度模式可提升可见度。 启用后，深色高对比度主题会更注重显示效果而非美观性。

# AdvancedSetting.horizontalScrollingSensitivity
source: Sensitivity of mouse wheel for horizontal scrolling. Use 0 to disable. Value should be between 0 and 1. Changes to this setting only affect new sessions.
de: Empfindlichkeit des Mausrads für horizontales Scrollen. Verwenden Sie 0, um es zu deaktivieren. Der Wert sollte zwischen 0 und 1 liegen. Änderungen an dieser Einstellung wirken sich nur auf neue Sitzungen aus.
ja: 水平スクロールに対するマウスホイールの感度。 無効にするには 0 を指定してください。値は 0 から 1 の間で指定します。この設定への変更は新しいセッションにのみ影響します。
pt_br: Sensibilidade da roda do mouse para rolagem horizontal. Use 0 para desativar. O valor deve estar entre 0 e 1. Alterações neste ajuste só afetam novas sessões.
ru: Чувствительность колеса мыши для горизонтальной прокрутки. Используйте 0, чтобы отключить. Значение должно быть между 0 и 1. Изменения этой настройки влияют только на новые сессии.
zh_hans: 鼠标滚轮用于水平滚动的灵敏度。 设为0可禁用该功能。数值应在0到1之间。此设置仅对新建会话生效。

# AdvancedSetting.hotKeyDoubleTapMaxDelay
source: The maximum amount of time allowed between presses of a modifier key when performing a modifier double-tap.
de: Die maximal zulässige Zeit zwischen dem Drücken einer Modifizierertaste bei einem Modifizierer-Doppeltipp.
ja: 修飾キーのダブルタップを行う際に、修飾キーの押下間で許容される最大の時間。
pt_br: O tempo máximo permitido entre pressionamentos de uma tecla modificadora ao realizar um toque duplo de modificador.
ru: Максимальное время между нажатиями клавиши-модификатора при двойном нажатии модификатора.
zh_hans: 执行修饰键双击操作时，两次按下修饰键之间允许的最大时间间隔。

# AdvancedSetting.hotKeyDoubleTapMinDelay
source: The minimum amount of time required between presses of a modifier key when performing a modifier double-tap.
de: Die minimal erforderliche Zeit zwischen dem Drücken einer Modifizierertaste bei einem Modifizierer-Doppeltipp.
ja: 修飾キーのダブルタップを行う際に、修飾キーの押下間で必要な最小の時間。
pt_br: O tempo mínimo necessário entre pressionamentos de uma tecla modificadora ao realizar um toque duplo de modificador.
ru: Минимальное время, требуемое между нажатиями клавиши-модификатора при двойном нажатии модификатора.
zh_hans: 执行修饰键双击操作时，两次按下修饰键之间所需的最小时间间隔。

# AdvancedSetting.hotkeyTermAnimationDuration
source: Duration in seconds of the hotkey window animation. Warning: reducing this value may cause problems if you have multiple displays.
de: Dauer der Hotkey-Fenster-Animation in Sekunden. Warnung: Das Verringern dieses Werts kann bei mehreren Bildschirmen zu Problemen führen.
ja: ホットキーウィンドウのアニメーションの継続時間 (秒単位)。 警告: この値を小さくすると、複数のディスプレイを使用している場合に問題が発生することがあります。
pt_br: Duração em segundos da animação da janela Hotkey. Aviso: reduzir este valor pode causar problemas se você tiver várias telas.
ru: Длительность в секундах анимации окна горячей клавиши. Предупреждение: уменьшение этого значения может вызвать проблемы при нескольких дисплеях.
zh_hans: 热键窗口动画的持续时间（以秒为单位）。 警告：如果使用多显示器，降低此值可能会导致问题。

# AdvancedSetting.hotkeyWindowFloatsAboveOtherWindows
source: The hotkey window floats above other windows even when another application is active. You must disable “Settings > Keys > Hotkey window hides when focus is lost” for this setting to be effective.
de: Das Hotkey-Fenster schwebt auch dann über anderen Fenstern, wenn eine andere Anwendung aktiv ist. Sie müssen „Einstellungen > Tasten > Hotkey-Fenster wird ausgeblendet, wenn der Fokus verloren geht“ deaktivieren, damit diese Einstellung wirksam wird.
ja: ホットキーウィンドウは、別のアプリケーションがアクティブな場合でも他のウィンドウの上に表示されます。 この設定を有効にするには、「設定 > キー > フォーカスを失うとホットキーウィンドウを隠す」を無効にする必要があります。
pt_br: A janela Hotkey fica acima das outras janelas mesmo quando outro aplicativo está ativo. Você precisa desativar “Ajustes > Teclas > A janela Hotkey se oculta ao perder o foco” para que este ajuste tenha efeito.
ru: Окно горячей клавиши плавает над другими окнами, даже когда активно другое приложение. Чтобы эта настройка подействовала, нужно отключить «Настройки → Клавиши → Окно горячей клавиши скрывается при потере фокуса».
zh_hans: 即使有其他应用程序处于活动状态，热键窗口也会显示在其他窗口之上。 要使此设置生效，必须先关闭“设置 > 键盘 > 失去焦点时隐藏热键窗口”选项。

# AdvancedSetting.hotkeyWindowsExcludedFromCycling
source: Hotkey windows are excluded from Cycle Through Windows.
de: Hotkey-Fenster werden bei „Durch Fenster wechseln“ ausgeschlossen.
ja: ホットキーウィンドウは「ウィンドウを順に切り替え」の対象から除外されます。
pt_br: As janelas Hotkey são excluídas de Alternar entre janelas.
ru: Окна горячей клавиши исключены из «Переключения между окнами».
zh_hans: 热键窗口不会被“循环切换窗口”功能所影响。

# AdvancedSetting.idempotentTriggerModeRateLimit
source: When evaluating idempotent triggers in interactive apps, wait this long (in seconds) between updates. This limits the performance impact of trigger evaluation.
de: Bei der Auswertung idempotenter Trigger in interaktiven Anwendungen so lange (in Sekunden) zwischen Aktualisierungen warten. Dies begrenzt die Auswirkung der Trigger-Auswertung auf die Leistung.
ja: 対話型アプリで冪等なトリガーを評価する際、更新の間にこの時間 (秒単位) だけ待機します。 これにより、トリガー評価によるパフォーマンスへの影響を制限します。
pt_br: Ao avaliar gatilhos idempotentes em apps interativos, aguarde este tempo (em segundos) entre atualizações. Isto limita o impacto de desempenho da avaliação de gatilhos.
ru: При вычислении идемпотентных триггеров в интерактивных приложениях ждать это время (в секундах) между обновлениями. Это ограничивает влияние вычисления триггеров на производительность.
zh_hans: 在交互式应用程序中评估幂等触发器时，更新之间需等待的时长（以秒为单位）。 这有助于限制触发器评估对性能的影响。

# AdvancedSetting.idleTimeSeconds
source: Time in seconds before a session is considered idle. Used for updating icons and activity indicator in tabs.
de: Zeit in Sekunden, nach der eine Sitzung als inaktiv gilt. Wird verwendet, um Symbole und die Aktivitätsanzeige in Tabs zu aktualisieren.
ja: セッションがアイドルとみなされるまでの時間 (秒単位)。 タブ内のアイコンとアクティビティインジケーターの更新に使用されます。
pt_br: Tempo em segundos antes de uma sessão ser considerada ociosa. Usado para atualizar ícones e o indicador de atividade nas abas.
ru: Время в секундах, по истечении которого сессия считается простаивающей. Используется для обновления значков и индикатора активности во вкладках.
zh_hans: 会话视为空闲前的秒数。 用于更新标签页中的图标和活动指示器。
